test-barcelona.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <searchHotelFaresRQ1 xmlns="http://www.softur.com.ar/wsbridge/budget.wsdl">
      <cityLocation code="BCN" xmlns="" />
      <dateFrom xmlns="">2025-12-10</dateFrom>
      <dateTo xmlns="">2025-12-17</dateTo>
      <name Code="" xmlns="" />
      <pos xmlns="">
        <id>LOZADAWS</id>
        <clave>.LOZAWS23.</clave>
      </pos>
      <currency xmlns="">USD</currency>
      <OtherBroker xmlns="">true</OtherBroker>
      <FareTypeSelectionList xmlns="http://www.softur.com.ar/wsbridge/budget.xsd">
        <FareTypeSelection type="" FareIdBroker="" OccupancyId="1" />
        <Ocuppancy OccupancyId="1">
          <Occupants type="ADT" Age="30" />
          <Occupants type="ADT" Age="30" />
        </Ocuppancy>
      </FareTypeSelectionList>
    </searchHotelFaresRQ1>
  </soap:Body>
</soap:Envelope>